arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lptmr/fsl_lptmr_driver.c
    return clkfreq;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : lptmr_Ticks2Us
 * Description   : Transform timer ticks to microseconds using the given
 *  prescaler settings. Clock frequency must be valid ( different from 0).
 * Possible return values:
 * - true: conversion success
 * - false: conversion failed, result did not fit in 32-bit.
 *
 *END**************************************************************************/
static bool lptmr_Ticks2Us(
    const uint32_t clkfreq,
    const lptmr_prescaler_t pval,
    const bool bypass,
    const uint16_t ticks,
    uint32_t* const us
    )
{
    bool success = true;
    uint8_t p = lptmr_cfg2p(pval, bypass);
    uint64_t nn = ( (uint64_t)ticks + 1u ) << p;
    uint64_t us_real = (nn * 1000000u) / (clkfreq);
    uint32_t us_local;

    if ( us_real <= (0xFFFFFFFFu) )
    {
        us_local = (uint32_t)us_real;
    }
    else
    {
        us_local = 0xFFFFFFFFu;
        success = false;
    }

    *us = us_local;
    return success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : lptmr_Us2Ticks
 * Description   : Transform microseconds to timer ticks using the given
 *  prescaler settings. Input clock frequency, clkfreq, must be greater than 0.
 * Possible return values:
 * - true: conversion completed successfully
 * - false: conversion failed, value did not fit in 16-bit.
 *
 *END**************************************************************************/
static bool lptmr_Us2Ticks(
    const uint32_t clkfreq,
    const lptmr_prescaler_t prescval,
    const bool bypass,
    const uint32_t us,
    uint16_t* const ticks
    )
{
    bool success = true;
    /* Transform prescaler configuration to prescaler coefficient p */
    uint8_t p = lptmr_cfg2p(prescval, bypass);
    /* Compute nn, the number of ticks necessary for the period in microseconds
        without any prescaler */
    uint64_t nn = lptmr_us2nn(clkfreq, us);
    /* Compute nticks, total number of ticks with prescaler */
    uint64_t nticks = lptmr_compute_nticks(nn, p);
    /* Transform nticks to value to be written to register */
    success = nticks2compare_ticks(nticks, ticks);
    return success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : lptmr_ChooseClkConfig
 * Description   : Choose clocking configuration (prescaler value, timer ticks)
 *  for the desired timeout period, given in microseconds. Input clock frequency,
 *  clkfreq, must be greater than 0.
 * Possible return values:
 * - true: configuration found
 * - false: configuration mismatch, desired timeout period is too small or too
 * big for the clock settings.
 *
 *END**************************************************************************/
static bool lptmr_ChooseClkConfig(
    const uint32_t clkfreq,
    const uint32_t us,
    lptmr_prescaler_t* const prescval,
    bool* const bypass,
    uint16_t* const ticks
    )
{
    uint8_t p;
    uint64_t nticks;
    bool success;

    uint64_t nn = lptmr_us2nn(clkfreq, us);

    /* Find the lowest prescaler value that allows the compare value in 16-bits */
    for (p = 0u; p <= 16u; p++)
    {
        nticks = lptmr_compute_nticks(nn, p);

        if (nticks <= 0x10000u)
        {
            /* Search finished, value will fit in the 16-bit register */
            break;
        }
    }

    success = nticks2compare_ticks(nticks, ticks);

    /* Convert p to prescaler configuration */
    if (p == 0u)
    {
        /* Prescaler value of 1 */
        *bypass = true;
        *prescval = LPTMR_PRESCALE_2;
    }
    else{
        *bypass = false;
        *prescval = (lptmr_prescaler_t)(p - 1u);
    }

    return success;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : lptmr_SetTimerConfig
 * Description   : This function configures the timer settings in Timer Mode,
 *  using microseconds for the period/timeout value.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS: settings found and written to hardware.
 * - LPTMR_DRV_WARNING_INCORRECT_TIMING: settings might not be correct (period
 *  is too small/ too large for the selected clock source) but the closest
 *  possible settings were written.
 *
 *END**************************************************************************/
static lptmr_status_t lptmr_SetTimerConfig(
    LPTMR_Type* const base,
    const lptmr_timer_config_t* const config,
    const uint32_t clkfreq
    )
{
    lptmr_status_t return_code = LPTMR_DRV_SUCCESS;

    /* Choose what compare value to use for prescaler calculation */
    lptmr_prescaler_t prescval = LPTMR_PRESCALE_2;
    bool bypass = false;
    uint16_t compareval = 0u;
    bool success = true;

    if (!config->freeRun)
    {
        /* Find the best clock configuration */
        success = lptmr_ChooseClkConfig(clkfreq, config->compareValueUs, &prescval,
            &bypass, &compareval);
    }
    else
    {
        /* Find the smallest prescaler configuration that fits maxCompareValueUs*/
        uint16_t dummyval;
        bool success_config = lptmr_ChooseClkConfig(clkfreq, config->maxCompareValueUs, &prescval,
            &bypass, &dummyval);
        bool success_conv = lptmr_Us2Ticks(clkfreq, prescval, bypass, config->compareValueUs,
            &compareval);
        success = success_config && success_conv;
    }

    if (!success)
    {
        return_code = LPTMR_DRV_WARNING_INCORRECT_TIMING;
    }

    /* Write configuration */
    LPTMR_HAL_SetDmaRequest(base, config->dmaRequest);
    LPTMR_HAL_SetInterrupt(base, config->interruptEnable);
    LPTMR_HAL_SetFreeRunning(base, config->freeRun);
    LPTMR_HAL_SetWorkMode(base, LPTMR_WORKMODE_TIMER);
    LPTMR_HAL_SetClockSelect(base, config->clockSelect);
    LPTMR_HAL_SetPrescaler(base, prescval);
    LPTMR_HAL_SetBypass(base, bypass);
    LPTMR_HAL_SetCompareValue(base, compareval);

    return return_code;
}

/*! @endcond */

