arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lptmr/fsl_lptmr_driver.c
/*******************************************************************************
 * Code
 ******************************************************************************/

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_InitGeneralConfigStruct
 * Description   : Initialize the General use-case (Timer or Pulse-Counter)
 * configuration structure with default values.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS.
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_InitGeneralConfigStruct(
    lptmr_general_config_t* const config
    )
{
    DEV_ASSERT(config != NULL);

    /* Initialize struct with default values */
    config->dmaRequest = false;
    config->interruptEnable = false;
    config->pinSelect = LPTMR_PINSELECT_TRGMUX;
    config->pinPolarity = LPTMR_PINPOLARITY_RISING;
    config->freeRun = false;
    config->workMode = LPTMR_WORKMODE_TIMER;
    config->prescaler = LPTMR_PRESCALE_2;
    config->bypassPrescaler = false;
    config->clockSelect = LPTMR_CLOCKSOURCE_SIRC;
    config->compareValue = 0u;

    return LPTMR_DRV_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_InitGeneral
 * Description   : Initialize the hardware with given configuration in the
 *  General use-case (Timer or Pulse-Counter).
 * Possible return values:
 * - return value from LPTMR_DRV_SetGeneralConfig
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_InitGeneral(
    const uint32_t instance,
    const lptmr_general_config_t* const config,
    const bool startcounter
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);
    DEV_ASSERT(config != NULL);

    LPTMR_Type* const base = g_lptmrBase[instance];

    lptmr_status_t status = LPTMR_DRV_SetGeneralConfig(instance, config);

    /* Start the counter if requested */
    if ( (status == LPTMR_DRV_SUCCESS) && (startcounter) )
    {
        LPTMR_HAL_Enable(base);
    }

    return status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_SetGeneralConfig
 * Description   : Configure the hardware in the General use-case
 *  (Timer or Pulse-Counter).
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 * - LPTMR_DRV_FAIL_CANNOT_CONFIGURE: counter already started
 * - LPTMR_DRV_FAIL_INVALID_CLOCK: invalid clock source
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_SetGeneralConfig(
    const uint32_t instance,
    const lptmr_general_config_t* const config
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);
    DEV_ASSERT(config != NULL);

    LPTMR_Type* const base = g_lptmrBase[instance];

    /* Check if the peripheral is enabled preventing a new configuration */
    bool enabled = LPTMR_HAL_GetEnable(base);

    if (enabled)
    {
        return LPTMR_DRV_FAIL_CANNOT_CONFIGURE;
    }

    /* Check if a valid clock is selected for the timer/glitch filter */
    if ( (!config->bypassPrescaler) || (config->workMode == LPTMR_WORKMODE_TIMER) )
    {
        uint32_t clkfreq = lptmr_GetClkFreq(config->clockSelect, instance);

        if (clkfreq == 0u)
        {
            return LPTMR_DRV_FAIL_INVALID_CLOCK;
        }
    }

    /* Initialize and write configuration */
    LPTMR_HAL_Init(base);
    LPTMR_HAL_SetDmaRequest(base, config->dmaRequest);
    LPTMR_HAL_SetInterrupt(base, config->interruptEnable);
    LPTMR_HAL_SetPinSelect(base, config->pinSelect);
    LPTMR_HAL_SetPinPolarity(base, config->pinPolarity);
    LPTMR_HAL_SetFreeRunning(base, config->freeRun);
    LPTMR_HAL_SetWorkMode(base, config->workMode);
    LPTMR_HAL_SetPrescaler(base, config->prescaler);
    LPTMR_HAL_SetBypass(base, config->bypassPrescaler);
    LPTMR_HAL_SetClockSelect(base, config->clockSelect);
    LPTMR_HAL_SetCompareValue(base, config->compareValue);

    return LPTMR_DRV_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_GetGeneralConfig
 * Description   : Return the current configuration of the LPTMR in the General
 * use-case layout.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_GetGeneralConfig(
    const uint32_t instance,
    lptmr_general_config_t* const config
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);
    DEV_ASSERT(config != NULL);

    LPTMR_Type* const base = g_lptmrBase[instance];

    /* Read configuration */
    config->dmaRequest = LPTMR_HAL_GetDmaRequest(base);
    config->interruptEnable = LPTMR_HAL_GetInterruptEnable(base);
    config->pinSelect = LPTMR_HAL_GetPinSelect(base);
    config->pinPolarity = LPTMR_HAL_GetPinPolarity(base);
    config->freeRun = LPTMR_HAL_GetFreeRunning(base);
    config->workMode = LPTMR_HAL_GetWorkMode(base);
    config->prescaler = LPTMR_HAL_GetPrescaler(base);
    config->bypassPrescaler = LPTMR_HAL_GetBypass(base);
    config->clockSelect = LPTMR_HAL_GetClockSelect(base);
    config->compareValue = LPTMR_HAL_GetCompareValue(base);

    return LPTMR_DRV_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_InitTimerConfigStruct
 * Description   : Initialize the Timer use-case configuration structure with
 *  default values.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_InitTimerConfigStruct(
    lptmr_timer_config_t* const config
    )
{
    DEV_ASSERT(config != NULL);

    /* Initialize struct with default values */
    config->dmaRequest = false;
    config->interruptEnable = false;
    config->freeRun = false;
    config->clockSelect = LPTMR_CLOCKSOURCE_SIRC;
    config->compareValueUs = 0u;

    return LPTMR_DRV_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_InitTimer
 * Description   :  Initialize the hardware with given configuration in the
 *  Timer use-case.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 * - LPTMR_DRV_FAIL_CANNOT_CONFIGURE: timer already running
 * - LPTMR_DRV_FAIL_INVALID_CLOCK: clock source invalid. No settings written.
 * - return code from lptmr_SetTimerConfig
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_InitTimer(
    const uint32_t instance,
    const lptmr_timer_config_t* const config,
    const bool startcounter
    )
{
    lptmr_status_t status = LPTMR_DRV_SUCCESS;

    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);
    DEV_ASSERT(config != NULL);

    LPTMR_Type* const base = g_lptmrBase[instance];

    /* Check if the peripheral is enabled preventing a new configuration */
    bool enabled = LPTMR_HAL_GetEnable(base);

