arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lptmr/fsl_lptmr_driver.c
    if (enabled)
    {
        return LPTMR_DRV_FAIL_CANNOT_CONFIGURE;
    }

    uint32_t clkfreq = lptmr_GetClkFreq(config->clockSelect, instance);

    if (clkfreq == 0u)
    {
        return LPTMR_DRV_FAIL_INVALID_CLOCK;
    }

    LPTMR_HAL_Init(base);
    status = lptmr_SetTimerConfig(base, config, clkfreq);

    /* Start the counter if requested */
    if ( (status == LPTMR_DRV_SUCCESS) && (startcounter) )
    {
        LPTMR_HAL_Enable(base);
    }

    return status;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_SetTimerConfig
 * Description   : Configure the hardware in the Timer use-case. Can be used
 *  only in Timer Mode.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 * - LPTMR_DRV_FAIL_CANNOT_CONFIGURE: timer started
 * - LPTMR_DRV_FAIL_MODE_MISMATCH: not in Timer Mode
 * - LPTMR_DRV_FAIL_INVALID_CLOCK: clock source invalid. No settings written.
 * - return code from lptmr_SetTimerConfig
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_SetTimerConfig(
    const uint32_t instance,
    const lptmr_timer_config_t* const config
    )
{
    lptmr_status_t return_code = LPTMR_DRV_SUCCESS;

    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);
    DEV_ASSERT(config != NULL);

    LPTMR_Type* const base = g_lptmrBase[instance];

    /* Check if the peripheral is enabled preventing a new configuration */
    bool enabled = LPTMR_HAL_GetEnable(base);

    if (enabled)
    {
        return LPTMR_DRV_FAIL_CANNOT_CONFIGURE;
    }

    /* Check if the peripheral is in Timer mode */
    lptmr_workmode_t workmode = LPTMR_HAL_GetWorkMode(base);

    if (workmode != LPTMR_WORKMODE_TIMER)
    {
        return LPTMR_DRV_FAIL_MODE_MISMATCH;
    }

    uint32_t clkfreq = lptmr_GetClkFreq(config->clockSelect, instance);

    if (clkfreq == 0u)
    {
        return LPTMR_DRV_FAIL_INVALID_CLOCK;
    }

    return_code = lptmr_SetTimerConfig(base, config, clkfreq);
    return return_code;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_GetTimerConfig
 * Description   : Return the current configuration of the LPTMR in the Timer
 * use-case layout. Can be used only in Timer Mode.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 * - LPTMR_DRV_FAIL_INVALID_CLOCK: no clock source
 * - LPTMR_DRV_FAIL_MODE_MISMATCH: not in Timer Mode
 * - LPTMR_DRV_WARNING_INCORRECT_TIMING: computed settings might not be correct
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_GetTimerConfig(
    const uint32_t instance,
    lptmr_timer_config_t* const config
    )
{
    lptmr_status_t return_code = LPTMR_DRV_SUCCESS;

    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);
    DEV_ASSERT(config != NULL);

    LPTMR_Type* const base = g_lptmrBase[instance];

    /* Check if the peripheral is in Timer mode */
    lptmr_workmode_t workmode = LPTMR_HAL_GetWorkMode(base);

    if (workmode != LPTMR_WORKMODE_TIMER)
    {
        return LPTMR_DRV_FAIL_MODE_MISMATCH;
    }

    uint32_t clkfreq = lptmr_GetClkFreq(config->clockSelect, instance);

    if (clkfreq == 0u)
    {
        return LPTMR_DRV_FAIL_INVALID_CLOCK;
    }

    /* Read configuration */
    config->dmaRequest = LPTMR_HAL_GetDmaRequest(base);
    config->interruptEnable = LPTMR_HAL_GetInterruptEnable(base);
    config->freeRun = LPTMR_HAL_GetFreeRunning(base);
    config->clockSelect = LPTMR_HAL_GetClockSelect(base);
    /* compute us from freq and prescaler */
    lptmr_prescaler_t prescval = LPTMR_HAL_GetPrescaler(base);
    bool bypass = LPTMR_HAL_GetBypass(base);
    uint16_t ticks = LPTMR_HAL_GetCompareValue(base);
    bool success = lptmr_Ticks2Us( clkfreq, prescval, bypass, ticks,
        &(config->compareValueUs) );

    if (!success)
    {
        return_code = LPTMR_DRV_WARNING_INCORRECT_TIMING;
    }

    return return_code;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_SetCompareValueUs
 * Description   : Set the Compare Value in Timer mode using microsecond units.
 *  Can be used only in Timer Mode.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 * - LPTMR_DRV_FAIL_CANNOT_CONFIGURE: timer started
 * - LPTMR_DRV_FAIL_MODE_MISMATCH: not in Timer Mode
 * - LPTMR_DRV_FAIL_INVALID_CLOCK: no clock source
 * - LPTMR_DRV_WARNING_EVENT_EXPIRED: compare value set too late
 * - LPTMR_DRV_WARNING_INCORRECT_TIMING: timing value might not be correct
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_SetCompareValueUs(
    const uint32_t instance,
    uint32_t compareValueUs
    )
{
    lptmr_status_t return_code = LPTMR_DRV_SUCCESS;

    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);

    LPTMR_Type* const base = g_lptmrBase[instance];

    /* Check if the compare value can be written:
        - counter must be disabled or the compare flag set
     */
    bool enabled = LPTMR_HAL_GetEnable(base);
    bool compareflag = LPTMR_HAL_GetCompareFlag(base);

    if (enabled && !compareflag)
    {
        return LPTMR_DRV_FAIL_CANNOT_CONFIGURE;
    }

    /* Check if the peripheral is in Timer mode */
    lptmr_workmode_t workmode = LPTMR_HAL_GetWorkMode(base);

    if (workmode != LPTMR_WORKMODE_TIMER)
    {
        return LPTMR_DRV_FAIL_MODE_MISMATCH;
    }

    /* Get configured clock value */
    lptmr_clocksource_t clksrc = LPTMR_HAL_GetClockSelect(base);
    uint32_t clkfreq = lptmr_GetClkFreq(clksrc, instance);

    if (clkfreq == 0u)
    {
        /* INVALID_CLOCKING */
        return LPTMR_DRV_FAIL_INVALID_CLOCK;
    }

    /* Get prescaler, bypass and compare value */
    lptmr_prescaler_t prescval = LPTMR_HAL_GetPrescaler(base);
    bool bypass = LPTMR_HAL_GetBypass(base);
    /* Compute ticks value */
    /* Prescaler *cannot* be changed */
    uint16_t val;
    bool success = lptmr_Us2Ticks(clkfreq, prescval, bypass, compareValueUs,
        &val);
    /* Write value and check if written successfully */
    LPTMR_HAL_SetCompareValue(base, val);
    uint16_t counterval = LPTMR_HAL_GetCounterValue(base);

    if (counterval >= val)
    {
        return_code = LPTMR_DRV_WARNING_EVENT_EXPIRED;
    }

