arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lptmr/fsl_lptmr_driver.c
    if (!success)
    {
        return_code = LPTMR_DRV_WARNING_INCORRECT_TIMING;
    }

    return return_code;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_GetCompareValueUs
 * Description   : Return the Compare Value in Timer mode using microsecond
 *  representation. Can be used only in Timer Mode.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 * - LPTMR_DRV_FAIL_INVALID_CLOCK: no clock source
 * - LPTMR_DRV_FAIL_MODE_MISMATCH: not in Timer Mode
 * - LPTMR_DRV_WARNING_INCORRECT_TIMING: timing value might not be correct
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_GetCompareValueUs(
    const uint32_t instance,
    uint32_t* const compareValueUs
    )
{
    lptmr_status_t return_code = LPTMR_DRV_SUCCESS;

    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);
    DEV_ASSERT(compareValueUs != NULL);

    LPTMR_Type* const base = g_lptmrBase[instance];

    /* Check if the peripheral is in Timer mode */
    lptmr_workmode_t workmode = ( LPTMR_HAL_GetWorkMode(base) );

    if (workmode != LPTMR_WORKMODE_TIMER)
    {
        return LPTMR_DRV_FAIL_MODE_MISMATCH;
    }

    /* Get configured clock value */
    lptmr_clocksource_t clksrc = LPTMR_HAL_GetClockSelect(base);
    uint32_t clkfreq = lptmr_GetClkFreq(clksrc, instance);

    if (clkfreq == 0u)
    {
        return LPTMR_DRV_FAIL_INVALID_CLOCK;
    }

    /* Get prescaler, bypass and compare value */
    lptmr_prescaler_t prescval = LPTMR_HAL_GetPrescaler(base);
    bool bypass = LPTMR_HAL_GetBypass(base);
    uint16_t ticks = LPTMR_HAL_GetCompareValue(base);
    /* Compute the compare value in microsec */
    bool success = lptmr_Ticks2Us(clkfreq, prescval, bypass, ticks,
        compareValueUs);

    if (!success)
    {
        return_code = LPTMR_DRV_WARNING_INCORRECT_TIMING;
    }

    return return_code;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_InitPulseCounterConfigStruct
 * Description   : Initialize the Pulse-Counter use-case configuration
 *  structure with default values.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_InitPulseCounterConfigStruct(
    lptmr_pulsecounter_config_t* const config
    )
{
    DEV_ASSERT(config != NULL);

    /* Initialize struct with default values */
    config->dmaRequest = false;
    config->interruptEnable = false;
    config->pinSelect = LPTMR_PINSELECT_TRGMUX;
    config->pinPolarity = LPTMR_PINPOLARITY_RISING;
    config->freeRun = false;
    config->prescaler = LPTMR_PRESCALE_4_GLITCHFILTER_2;
    config->bypassPrescaler = false;
    config->clockSelect = LPTMR_CLOCKSOURCE_SIRC;
    config->compareValue = 0u;

    return LPTMR_DRV_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_InitPulseCounter
 * Description   : Initialize the hardware with given configuration in the
 *  Pulse-Counter use-case.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 * - LPTMR_DRV_FAIL_CANNOT_CONFIGURE: counter already started
 * - LPTMR_DRV_FAIL_INVALID_CLOCK: invalid clock source
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_InitPulseCounter(
    const uint32_t instance,
    const lptmr_pulsecounter_config_t* const config,
    const bool startcounter
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);
    DEV_ASSERT(config != NULL);

    LPTMR_Type* const base = g_lptmrBase[instance];

    /* Check if the peripheral is enabled preventing a new configuration */
    bool enabled = LPTMR_HAL_GetEnable(base);

    if (enabled)
    {
        return LPTMR_DRV_FAIL_CANNOT_CONFIGURE;
    }

    /* Check if a valid clock is selected for the glitch filter */
    if (!config->bypassPrescaler)
    {
        uint32_t clkfreq = lptmr_GetClkFreq(config->clockSelect, instance);

        if (clkfreq == 0u)
        {
            return LPTMR_DRV_FAIL_INVALID_CLOCK;
        }
    }

    /* Initialize and write configuration */
    LPTMR_HAL_Init(base);
    LPTMR_HAL_SetDmaRequest(base, config->dmaRequest);
    LPTMR_HAL_SetInterrupt(base, config->interruptEnable);
    LPTMR_HAL_SetPinSelect(base, config->pinSelect);
    LPTMR_HAL_SetPinPolarity(base, config->pinPolarity);
    LPTMR_HAL_SetFreeRunning(base, config->freeRun);
    LPTMR_HAL_SetWorkMode(base, LPTMR_WORKMODE_PULSECOUNTER);
    LPTMR_HAL_SetPrescaler(base, config->prescaler);
    LPTMR_HAL_SetBypass(base, config->bypassPrescaler);
    LPTMR_HAL_SetClockSelect(base, config->clockSelect);
    LPTMR_HAL_SetCompareValue(base, config->compareValue);

    /* Start the counter if requested */
    if (startcounter)
    {
        LPTMR_HAL_Enable(base);
    }

    return LPTMR_DRV_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_SetPulseCounterConfig
 * Description   : Configure the hardware in the Pulse-Counter use-case. Can be
 *  used only in Pulse-Counter Mode.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 * - LPTMR_DRV_FAIL_MODE_MISMATCH: not in Pulse-Counter mode
 * - LPTMR_DRV_FAIL_CANNOT_CONFIGURE: counter already started
 * - LPTMR_DRV_FAIL_INVALID_CLOCK: invalid clock source for the glitch filter.
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_SetPulseCounterConfig(
    const uint32_t instance,
    const lptmr_pulsecounter_config_t* const config
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);
    DEV_ASSERT(config != NULL);

    LPTMR_Type* const base = g_lptmrBase[instance];

    /* Check if the peripheral is enabled preventing a new configuration */
    bool enabled = LPTMR_HAL_GetEnable(base);

    if (enabled)
    {
        return LPTMR_DRV_FAIL_CANNOT_CONFIGURE;
    }

    /* Check if the peripheral is in Pulse Counter mode */
    lptmr_workmode_t workmode = LPTMR_HAL_GetWorkMode(base);

    if (workmode != LPTMR_WORKMODE_PULSECOUNTER)
    {
        return LPTMR_DRV_FAIL_MODE_MISMATCH;
    }

    /* Check if a valid clock is selected for the glitch filter */
    if (!config->bypassPrescaler)
    {
        uint32_t clkfreq = lptmr_GetClkFreq(config->clockSelect, instance);

        if (clkfreq == 0u)
        {
            return LPTMR_DRV_FAIL_INVALID_CLOCK;
        }
    }

    /* Write configuration */
    LPTMR_HAL_SetDmaRequest(base, config->dmaRequest);
    LPTMR_HAL_SetInterrupt(base, config->interruptEnable);
    LPTMR_HAL_SetPinSelect(base, config->pinSelect);
    LPTMR_HAL_SetPinPolarity(base, config->pinPolarity);
    LPTMR_HAL_SetFreeRunning(base, config->freeRun);
    LPTMR_HAL_SetPrescaler(base, config->prescaler);
    LPTMR_HAL_SetBypass(base, config->bypassPrescaler);
    LPTMR_HAL_SetClockSelect(base, config->clockSelect);
    LPTMR_HAL_SetCompareValue(base, config->compareValue);

    return LPTMR_DRV_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_GetPulseCounterConfig
 * Description   : Return the current configuration of the LPTMR in the
 * Pulse-Counter use-case layout. Can be used only in Pulse-Counter Mode.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 * - LPTMR_DRV_FAIL_MODE_MISMATCH: not in Pulse-Counter mode.
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_GetPulseCounterConfig(
    const uint32_t instance,
    lptmr_pulsecounter_config_t* const config
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);
    DEV_ASSERT(config != NULL);

    LPTMR_Type* const base = g_lptmrBase[instance];

    /* Check if the peripheral is in Pulse Counter mode */
    lptmr_workmode_t workmode = LPTMR_HAL_GetWorkMode(base);

    if (workmode != LPTMR_WORKMODE_PULSECOUNTER)
    {
        return LPTMR_DRV_FAIL_MODE_MISMATCH;
    }

    /* Read configuration */
    config->dmaRequest = LPTMR_HAL_GetDmaRequest(base);
    config->interruptEnable = LPTMR_HAL_GetInterruptEnable(base);
    config->pinSelect = LPTMR_HAL_GetPinSelect(base);
    config->pinPolarity = LPTMR_HAL_GetPinPolarity(base);
    config->freeRun = LPTMR_HAL_GetFreeRunning(base);
    config->prescaler = LPTMR_HAL_GetPrescaler(base);
    config->bypassPrescaler = LPTMR_HAL_GetBypass(base);
    config->clockSelect = LPTMR_HAL_GetClockSelect(base);
    config->compareValue = LPTMR_HAL_GetCompareValue(base);

    return LPTMR_DRV_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_Deinit
 * Description   : De-initialize the LPTMR (stop the counter).
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_Deinit(
    const uint32_t instance
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);

    LPTMR_Type* const base = g_lptmrBase[instance];
    LPTMR_HAL_Disable(base);
    return LPTMR_DRV_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_SetCompareValueTicks
 * Description   : Set the Compare Value in Timer mode using timer units.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 * - LPTMR_DRV_FAIL_INVALID_CLOCK: no clock source
 * - LPTMR_DRV_FAIL_CANNOT_CONFIGURE: cannot reconfigure compare value
 * - LPTMR_DRV_WARNING_EVENT_EXPIRED: compare value set too late
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_SetCompareValueTicks(
    const uint32_t instance,
    const uint16_t compareval
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);

    LPTMR_Type* const base = g_lptmrBase[instance];

    /* Check if the compare value can be written:
        - counter must be disabled or the compare flag set
     */
    bool enabled = LPTMR_HAL_GetEnable(base);
    bool compareflag = LPTMR_HAL_GetCompareFlag(base);

