arvind747/S32K144_FlexCAN_LoopBackTest/SOURCE/PLATFORM/drivers/src/lptmr/fsl_lptmr_driver.c
    if (enabled && !compareflag)
    {
        return LPTMR_DRV_FAIL_CANNOT_CONFIGURE;
    }

    bool bypass = LPTMR_HAL_GetBypass(base);
    lptmr_workmode_t workmode = LPTMR_HAL_GetWorkMode(base);

    /* Check if a valid clock is selected for the timer/glitch filter */
    if ( (!bypass) || (workmode == LPTMR_WORKMODE_TIMER) )
    {
        lptmr_clocksource_t clocksrc = LPTMR_HAL_GetClockSelect(base);
        uint32_t clkfreq = lptmr_GetClkFreq(clocksrc, instance);

        if (clkfreq == 0u)
        {
            return LPTMR_DRV_FAIL_INVALID_CLOCK;
        }
    }

    /* Check if new value is below the current counter value */
    LPTMR_HAL_SetCompareValue(base, compareval);
    uint16_t counterval = LPTMR_HAL_GetCounterValue(base);

    if (counterval >= compareval)
    {
        return LPTMR_DRV_WARNING_EVENT_EXPIRED;
    }

    return LPTMR_DRV_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_GetCompareValueTicks
 * Description   : Return the Compare Value using timer ticks units
 *      representation.
 * Return value:
 *  - the compare value
 *
 *END**************************************************************************/
uint16_t LPTMR_DRV_GetCompareValueTicks(
    const uint32_t instance
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);

    LPTMR_Type* const base = g_lptmrBase[instance];
    uint16_t comparevalue = LPTMR_HAL_GetCompareValue(base);
    return comparevalue;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_GetCompareFlag
 * Description   : Get the current state of the Compare Flag
 *
 *END**************************************************************************/
bool LPTMR_DRV_GetCompareFlag(
    const uint32_t instance
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);

    LPTMR_Type* const base = g_lptmrBase[instance];
    bool compareflag = LPTMR_HAL_GetCompareFlag(base);
    return compareflag;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_ClearCompareFlag
 * Description   : Clear the Compare Flag.
 *
 *END**************************************************************************/
void LPTMR_DRV_ClearCompareFlag(
    const uint32_t instance
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);

    LPTMR_Type* const base = g_lptmrBase[instance];
    LPTMR_HAL_ClearCompareFlag(base);
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_SetInterrupt
 * Description   : Change the state of the Interrupt Enable setting.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 * - LPTMR_DRV_FAIL_CANNOT_CONFIGURE: cannot reconfigure setting
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_SetInterrupt(
    const uint32_t instance,
    const bool enableinterrupt
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);

    LPTMR_Type* const base = g_lptmrBase[instance];

    /* Check if the peripheral is enabled preventing a new configuration */
    bool enabled = LPTMR_HAL_GetEnable(base);

    if (enabled)
    {
        return LPTMR_DRV_FAIL_CANNOT_CONFIGURE;
    }

    LPTMR_HAL_SetInterrupt(base, enableinterrupt);
    return LPTMR_DRV_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_IsrInstallHandler
 * Description   : Install a new function to be executed as the LPTMR interrupt
 *  handler.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_IsrInstallHandler(
    const uint32_t instance,
    void (* isr)(
        void
        )
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);
    DEV_ASSERT(isr != NULL);

    (void)INT_SYS_InstallHandler(g_lptmrIrqId[instance], isr, (isr_t*) 0);
    INT_SYS_EnableIRQ(g_lptmrIrqId[instance]);

    return LPTMR_DRV_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_GetCounterValueTicks
 * Description   : Get the current Counter Value using timer ticks
 * representation.
 * Return:
 *  - the counter value.
 *
 *END**************************************************************************/
uint16_t LPTMR_DRV_GetCounterValueTicks(
    const uint32_t instance
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);

    LPTMR_Type* const base = g_lptmrBase[instance];
    uint16_t counterval = LPTMR_HAL_GetCounterValue(base);
    return counterval;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_StartCounter
 * Description   : Enable (start) the counter.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_StartCounter(
    const uint32_t instance
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);

    LPTMR_Type* const base = g_lptmrBase[instance];
    LPTMR_HAL_Enable(base);
    return LPTMR_DRV_SUCCESS;
}

/*FUNCTION**********************************************************************
 *
 * Function Name : LPTMR_DRV_StopCounter
 * Description   : Disable (stop) the counter.
 * Possible return values:
 * - LPTMR_DRV_SUCCESS:
 *
 *END**************************************************************************/
lptmr_status_t LPTMR_DRV_StopCounter(
    const uint32_t instance
    )
{
    DEV_ASSERT(instance < LPTMR_INSTANCE_COUNT);

    LPTMR_Type* const base = g_lptmrBase[instance];
    LPTMR_HAL_Disable(base);
    return LPTMR_DRV_SUCCESS;
}

/*******************************************************************************
 * EOF
 ******************************************************************************/
